Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: །ཤིང་ལས་ཤིང་ཏོག་བཞིན་དུ་མི་རྣམས་ནི།
en: “Just as fruits fall from trees,

source: །གཞོན་དང་བར་མ་རྒན་པོ་རྣམས་ཀྱང་ལྟུང་།
en: Young, middle-aged, and elderly people will fall.

source: །འདོད་པ་སྣ་ཚོགས་སྡུག་ཅིང་ཡིད་འོང་བ།
en: Various objects of desire are desirable and pleasant;

source: །རང་བཞིན་དེ་ལྟ་བུ་ཡིས་སེམས་རབ་འཇོམས།
en: They control the mind with such qualities.

source: །འདོད་པ་རྣམས་ཀྱིས་འདི་འཆིང་ཆགས་པར་འགྱུར།
en: “Objects of desire bind and fasten people to this world.

source: །འདོད་པ་ཡོད་ན་ཁོན་དང་འཇིགས་པ་སྐྱེ།
en: If there are objects of desire, there will arise anger and fear.

source: །དེ་ལྟས་རྒྱལ་པོ་འདི་ནས་རབ་བྱུང་སྟེ།
en: When I saw this, O King, I went forth from this world.

source: །དགེ་སྦྱོང་ཉིད་ནི་ཉམས་པ་མེད་མཆོག་ཡིན།
en: The state of the śramaṇa is indestructible; it is supreme.”

source: །དེ་ནས་རྒྱལ་པོ་ཀཽ་རབ་བྱ་ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་གིས་སྨྲས་པ་ལ་མངོན་པར་དགའ་སྟེ་ཡི་རངས་ནས་རྐང་པ་གཉིས་ལ་མགོ་བོས་ཕྱག་བྱས་ཏེ་སྟན་ལས་ལངས་ནས་སོང་ངོ་།
en: King Kauravya rejoiced in and praised the words of the venerable Rāṣṭrapāla. He bowed low until his forehead touched the feet of the venerable Rāṣṭrapāla, rose from his seat, and departed. V. Hastināpura

source: །བཅོམ་ལྡན་འདས་གླང་པོ་ཆེའི་གྲོང་རྡལ་དུ་བྱོན་པ་དང་། བྲམ་ཟེ་ཞིག་གིས་བཅོམ་ལྡན་འདས་སྐུ་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་བཅུ་རྩ་གཉིས་ཀྱིས་ཀུན་ནས་བརྒྱན་པ།
en: The Blessed One then arrived in Hastināpura.

source: དཔེ་བྱད་བཟང་པོ་བརྒྱད་བཅུས་མཛེས་པར་བྱས་པ། འོད་འདོམ་གང་གིས་བརྒྱན་པ། འོད་ཟེར་ཉི་མ་སྟོང་པས་ལྷག་པ། རིན་པོ་ཆེའི་རི་བོ་འགྲོ་བ་ལྟར་ཀུན་ནས་བཟང་བ་དེ་རྒྱང་རིང་པོ་ཁོ་ན་ནས་མཐོང་ངོ་། །མཐོང་ནས་ཀྱང་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་སོང་ནས་ཚིགས་སུ་བཅད་པས་བསྟོད་པར་བརྩམས་པ།
en: When from a distance a brahmin saw the Blessed One, who was fully ornamented with the thirty-two marks of a great man, illuminated by the eighty minor marks, ornamented with a fathom-wide halo, and beautiful like a moving mountain of jewels with light surpassing a thousand suns, the brahmin went to the Blessed One and praised him in verse:

source: གསེར་གྱི་མདོག་ཅན་མིག་ཏུ་སྡུག་པ་དང་། །དགའ་བའི་འབྱུང་གནས་ཡོན་ཏན་ཀུན་དང་ལྡན།
en: “Golden and pleasing to the eyes, You are the source of pleasure possessed of all good qualities,

source: །མི་འདུལ་ཁ་ལོ་སྒྱུར་བ་ལྷ་ཡི་ལྷ།
en: Tamer of people to be tamed, god of gods,

source: །སྲིད་པའི་རྒྱ་མཚོའི་ཕ་རོལ་བྱོན་པ་ལགས།
en: And one who has arrived at the far shore of the ocean of existence.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་འཛུམ་པ་མཛད་དོ།
en: Then the Blessed One smiled.

source: །ཆོས་ཉིད་ཀྱིས་གང་གི་ཚེ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་འཛུམ་པ་མཛད་པ་ན་ཞེས་བྱ་བ་ནས།
en: It naturally occurs that whenever the buddhas, the blessed ones, smile, . . . .

source: མཛོད་སྤུར་ནུབ་པར་གྱུར་ཏོ།
en: The rays disappeared into the circle of hair between his eyebrows.

source: །ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་ཐལ་མོ་སྦྱར་བ་བྱས་ནས་ཞུས་པ།
en: Then the venerable Ānanda made the gesture of supplication to the Blessed One and said:

source: །ཞེས་བྱ་བ་ནས་ཀུན་དགའ་བོ་དེ་དེ་བཞིན་ཏེ།
en: The Blessed One said, “Good, good, Ānanda!

source: དེ་དེ་བཞིན་ནོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ། །ཀུན་དགའ་བོ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ནི་རྒྱུ་མེད་རྐྱེན་མེད་པར་འཛུམ་པ་མི་མཛད་དོ།
en: Ānanda, tathāgatas, arhats, perfectly awakened ones do not smile without cause, without condition.

source: །ཀུན་དགའ་བོ་ཁྱོད་ཀྱིས་བྲམ་ཟེས་དེ་བཞིན་གཤེགས་པ་ལ་ཚིགས་སུ་བཅད་པས་བསྟོད་པ་གང་ཡིན་པ་མཐོང་ངམ།
en: Ānanda, did you see the brahmin speak the verse and praise the Tathāgata?”

source: །འདི་དགེ་བའི་རྩ་བ་འདིས་བསྐལ་པ་ཉི་ཤུར་ལོག་པར་ལྟུང་བར་འགྲོ་བར་མི་འགྱུར་ཏེ། འོན་ཀྱང་ལྷ་དང་མི་རྣམས་སུ་ཉིང་མཚམས་སྦྱར་ཅིང་འཁོར་ནས་སྲིད་པ་ཕྱི་མ་སྐྱེ་གནས་ཕྱི་མ་དང་། ལུས་ཕྱི་མ་དང་། བདག་གི་ངོ་བོ་ཐོབ་པ་ཕྱི་མ་ལ་རང་སངས་རྒྱས་བསྟོད་འོས་ཞེས་བྱ་བར་འགྱུར་རོ།
en: “By this root of merit he will never fall into the inferior modes of existence, but will be reborn among gods and humans for twenty eons, and he will become a self-awakened one named Stavārha in his last life, last birth, last body, last taking up of an identity.”

source: །དགེ་སློང་རྣམས་ཐེ་ཚོམ་སྐྱེས་ནས། ཐེ་ཚོམ་ཐམས་ཅད་གཅོད་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་ཞུས་པ། བཙུན་པ་བྲམ་ཟེ་འདིས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པ་གཅིག་གིས་བསྟོད་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་རང་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པ་ལ་གཟིགས།
en: The monks, feeling doubtful, inquired of the Buddha, the Blessed One, the one who severs all doubts, “How is it, O Honored One, that when this brahmin spoke a single verse and praised the Blessed One, the Blessed One predicted his awakening as a self-awakened one?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་ད་ལྟར་འབའ་ཞིག་ཏུ་མ་ཟད་ཀྱི། ཇི་ལྟར་འདིས་འདས་པའི་དུས་ན་ཡང་ང་ལ་ཚིགས་སུ་བཅད་པ་གཅིག་གིས་བསྟོད་པས། ངས་གྲོང་མཆོག་ལྔ་བྱིན་པ་དེ་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་བཤད་དོ།
en: “Listen, monks,” replied the Blessed One, “and inscribe it in your minds how, not only in the present but also in the past, he spoke a single verse and praised me, and how I gave him five excellent villages.

source: །དགེ་སློང་དག་སྔོན་བྱུང་བ་བཱ་རཱ་ཎ་སཱི་གྲོང་ཁྱེར་དུ་རྒྱལ་པོ་ཚངས་སྦྱིན་ཞེས་བྱ་བ་འབྱོར་པ་དང་། རྒྱས་པ་དང་། བདེ་བ་དང་། ལོ་ལེགས་པ་སྐྱེ་བོ་དང་མི་མང་པོས་རབ་ཏུ་གང་བ་ལ་རྒྱལ་སྲིད་བྱེད་དུ་འཇུག་སྟེ།
en: I will tell you about it. “A time long ago, monks, there was a king named Brahmadatta in the city of Vārāṇasī. He ruled over the country, which was rich, prosperous, peaceful, abundant in food, and full of many people.

source: དེ་ལྷག་པར་སྙན་དངགས་ལ་དགའ་བར་གྱུར་ཏོ།
en: He was extremely fond of poets.

source: །བཱ་རཱ་ཎ་སཱི་ན་བྲམ་ཟེ་སྙན་དངགས་མཁན་གཞན་ཞིག་ཡོད་པ་དེ་ལ་བྲམ་ཟེ་མོས་སྨྲས་པ། བྲམ་ཟེ་གྲང་བའི་དུས་ལ་བབ་ཀྱིས་རྒྱལ་པོ་དེའི་སྤྱན་སྔར་སོང་ལ་རྗེས་སུ་མཐུན་པའི་ལེགས་པར་སྨྲ་བ་འགའ་བྱོས་དང་། གལ་ཏེ་ན་གྲང་བའི་སྐྱབས་ཅུང་ཟད་འཐོབ་པར་འགྱུར་རོ།
en: “There was a certain brahmin poet in Vārāṇasī whose wife once said to him, ‘O brahmin, since the cold season has come, go to the king and make some agreeable speech so that you can obtain a little defense against the cold.’

source: །དེ་སོང་བ་ལས་ཇི་ཙམ་ན་རྒྱལ་པོ་གླང་པོ་ཆེ་ལ་ཞོན་ནས་བྱུང་ངོ་།
en: “So, he departed. At that time, the king was setting off on an elephant.

source: །བྲམ་ཟེ་དེས་བསམས་པ། ཅི་བདག་གིས་རྒྱལ་པོ་ལ་བསྟོད་དམ། འོན་ཏེ་གླང་པོ་ཆེ་དམ་པ་ལ་སྙམ་པ་ལས་དེ་འདི་སྙམ་དུ་སེམས་ཏེ། གླང་པོ་ཆེ་དམ་པ་འདི་ནི་འཇིག་རྟེན་ཐམས་ཅད་ཀྱིས་སྡུག་ཅིང་ཡིད་དུ་འོང་བ་ཡིན་ལ་རྒྱལ་པོ་ལ་ནི་ཁྱད་པར་དུ་ཡིན་པས། རེ་ཞིག་གླང་པོ་ཆེ་དམ་པ་མངོན་པར་བསྟོད་པར་བྱའོ་སྙམ་ནས་དེས་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: The brahmin asked himself, ‘Should I praise the king or the excellent elephant?’ He thought, ‘Since this excellent elephant is desirable and pleasing for everyone in the world and especially so for the king, I will praise the excellent elephant for now.’ He then spoke a verse:

source: ས་སྲུང་བུ་ཡི་ལུས་ཀྱི་ཤ་ཚུགས་ལྟར། །མཚན་མཆོག་ལྡན་པའི་གཟུགས་ནི་ཕུན་སུམ་ཚོགས།
en: “ ‘Perfect in its form, with excellent features, Just like the body of Airāvaṇa;

source: །མདོག་དང་ཚད་ཀྱིས་ལུས་ཀྱི་གཟུགས་ལེགས་པ།
en: With its bodily form, fair in color and great in size,

source: །གླང་ཆེན་དབང་པོ་བཀྲ་ཤིས་རབ་ཏུ་བསྔགས།
en: This great king of elephants is commended for auspiciousness.’

source: །དེ་ནས་རྒྱལ་པོ་མངོན་པར་དགའ་ནས་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: “The king was pleased and spoke a verse in return:

source: ཁོ་བོའི་གླང་ཆེན་སྡུག་ཅིང་ཡིད་འོང་བ།
en: “ ‘My great elephant is desirable and pleasing;

source: །མི་རྣམས་མིག་འཕྲོག་དགའ་བ་སྐྱེད་པ་གང་།
en: It holds people’s gaze and generates pleasure.

source: །དེ་ལ་ཁྱོད་ཀྱིས་བསྟོད་པའི་ཚིག་སྨྲས་ཀྱིས།
en: Since you have spoken a eulogy to it,

source: །ཁྱོད་ལ་གྲོང་གི་མཆོག་ནི་ལྔ་སྦྱིན་ནོ།
en: I will give you five excellent villages.’

source: །དགེ་སློང་དག་དེའི་ཚེ་དེའི་དུས་ཀྱི་གླང་པོ་ཆེ་དམ་པ་གང་ཡིན་པ་དེ་ནི་ང་ཉིད་ཡིན་ནོ།
en: “Monks, I myself was at that time, on that occasion, the excellent elephant;

source: །དེའི་ཚེ་དེའི་དུས་ཀྱི་བྲམ་ཟེ་གང་ཡིན་པ་དེ་ནི་བྲམ་ཟེ་འདི་ཉིད་ཡིན་ཏེ།
en: this brahmin was at that time, on that occasion, the brahmin.

source: དེ་ན་ཡང་ང་ལ་འདིས་ཚིགས་སུ་བཅད་པ་གཅིག་གིས་བསྟོད་པས་ངས་འདི་ལ་གྲོང་མཆོག་ལྔ་བྱིན་ནོ། །ད་ལྟར་ཡང་ང་ལ་འདིས་ཚིགས་སུ་བཅད་པ་གཅིག་གིས་བསྟོད་པས་ངས་ཡང་འདི་རང་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་ཏོ།
en: I then gave him five excellent villages because he had spoken a single verse and praised me. Now, too, I have predicted his awakening as a self-awakened one because he spoke a single verse and praised me.​​ VI. The Great City

source: །གྲོང་ཁྱེར་ཆེན་པོར་གཤེགས་ནས་གྲོང་ཁྱེར་ཆེན་པོར་སངས་རྒྱས་བཞིའི་གདན་ཞེས་བྱ་བའི་བར་རྒྱས་པར་གོང་མ་བཞིན་དུའོ།
en: Having arrived at a great city, . . . (the phrase about the seat of four buddhas should be recited in detail) . . . . VII.

source: །ཡུལ་སྲུག་ནར་གཤེགས་པ་དང་ཡུལ་སྲུག་ན་ན་བྲམ་ཟེ་དབང་པོ་ཞེས་བྱ་བ་གཟུགས་དང་ལང་ཚོ་དང་། ཐོས་པས་རྒྱགས་པར་གྱུར་ནས་བདག་དང་འདྲ་བ་ནི་འགའ་ཡང་ཡོད་པ་མ་ཡིན་ནོ་ཞེས་སྒྲོགས་ཤིང་རྣམ་པར་སྒྲོགས་སོ།
en: Śrughnā The Blessed One arrived in the country of Śrughnā, where there was a brahmin named Indra who was conceited about his good looks, youth, and learning, and boasted that there was no one equal to him.

source: །བཅོམ་ལྡན་འདས་ཀྱང་ཕྱོགས་གཞན་ཞིག་ན་དགེ་སློང་གི་དགེ་འདུན་གྱི་གུང་ལ་གདན་བཤམས་པ་ཉིད་ལ་བཞུགས་ཏེ་ཆོས་འཆད་དོ།
en: In a certain place the Blessed One preached the Dharma, sitting on the seat prepared for him in front of the community of monks.

source: །བྲམ་ཟེ་དབང་པོ་ཞེས་བྱ་བས་དགེ་སྦྱོང་གཽ་ཏ་མ་ཡུལ་སྲུག་ནར་བྱོན་ཏོ་ཞེས་ཐོས་ནས་དེ་འདི་སྙམ་དུ་སེམས་ཏེ། དགེ་སྦྱོང་གཽ་ཏ་མ་གཟུགས་བཟང་བ་མཛེས་པ་བལྟ་ན་སྡུག་པ་ཞེས་ཐོས་ཀྱིས།
en: The brahmin Indra, having heard that the śramaṇa Gautama had arrived in the country of Śrughnā, thought, “I have heard that the śramaṇa Gautama is well proportioned, attractive, and pleasant to behold.

source: ཅི་བདག་ལས་ལྷག་པར་གཟུགས་བཟང་བ་ཡིན་ནམ།
en: I will go to see whether he is more handsome than me or not.”

source: འོན་ཏེ་མ་ཡིན་ལྟར་འགྲོའོ་སྙམ་ནས་དེ་བྱུང་བ་དང་། ཇི་ཙམ་ན་བཅོམ་ལྡན་འདས་སྐུ་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་བཅུ་རྩ་གཉིས་ཀྱིས་ཀུན་ནས་བརྒྱན་པ། དཔེ་བྱད་བཟང་པོ་བརྒྱད་བཅུས་མཛེས་པར་བྱས་པ། འོད་འདོམ་གང་གིས་བརྒྱན་པ་འོད་ཟེར་ཉི་མ་སྟོང་བས་ལྷག་པ། རིན་པོ་ཆེའི་རི་བོ་འགྲོ་བ་ལྟར་ཀུན་ནས་བཟང་བ་མཐོང་ངོ་། །མཐོང་ནས་ཀྱང་འདི་སྙམ་དུ་སེམས་ཏེ།
en: He departed and when he saw the Blessed One, who was fully ornamented with the thirty-two marks of a great man, illuminated by the eighty minor marks, ornamented with a fathom-wide halo, and beautiful like a moving mountain of jewels with light surpassing a thousand suns, the brahmin thought, “Although the śramaṇa Gautama is more handsome than me, he is not taller than me.” He tried to see the crown of the Blessed One’s head.

source: དགེ་སྦྱོང་གཽ་ཏ་མ་ནི་བདག་བས་གཟུགས་ལྷག་པར་བཟང་མོད་ཀྱི། ཚད་ནི་ལྷག་པར་རིང་བ་ནི་མ་ཡིན་ནོ་སྙམ་ནས། བཅོམ་ལྡན་འདས་དེའི་གཙུག་ཏོར་བལྟ་བར་བརྩམས་པ་དང་། ཇི་ཙམ་ན་མ་མཐོང་ནས་དེ་ཕྱོགས་ཤིན་ཏུ་མཐོ་བ་ཞིག་ལ་འཛེགས་ན་འོན་ཀྱང་མ་མཐོང་ངོ་།
en: Unable to see it, he climbed up to a very high place, but it was in vain.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྲམ་ཟེ་དབང་པོ་ལ་བཀའ་སྩལ་པ།
en: Then the Blessed One said to the brahmin Indra, “Brahmin, you are making vain efforts.

source: བྲམ་ཟེ་ཉོན་མོངས་ཀྱིས་ཐོང་ཤིག །གལ་ཏེ་རི་རབ་ཀྱི་རྩེ་ལ་འཛེགས་ཏེ་བལྟས་ཀྱང་འོན་ཀྱང་ཆེས་ཉོན་མོངས་སུ་ཟད་ཀྱི་དེ་བཞིན་གཤེགས་པའི་གཙུག་ཏོར་ནི་མཐོང་བར་མི་འགྱུར་རོ།
en: Even if you were to climb up to the summit of Mount Sumeru and try to see the crown of the Tathāgata’s head, these further efforts would be in vain, and you would still be unable to see it.

source: །གཞན་ཡང་ཁྱོད་ཀྱིས་ལྷ་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་འགྲོ་བས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་གཙུག་ཏོར་མི་མཐོང་ངོ་། །ཞེས་མ་ཐོས་སམ། འོན་ཀྱང་གལ་ཏེ་དེ་བཞིན་གཤེགས་པའི་སྐུའི་ཚད་མཐོང་བར་འདོད་ན་ཁྱོད་ཀྱི་ཁྱིམ་ན་མེའི་སྦྱིན་སྲེག་བྱེད་པའི་འོག་ན་ཙན་དན་ས་མཆོག་ལས་བྱས་པའི་མཆོད་སྡོང་ཉིད་ཡོད་ཀྱིས་དེ་ཕྱུང་ལ་གཞོལ་ཅིག་དང་། དེ་བཞིན་གཤེགས་པའི་ཡབ་དང་། ཡུམ་ལས་འཁྲུངས་པའི་སྐུའི་ཚད་ནི་དེ་ཡིན་ནོ།
en: Have you never heard that beings, including gods and asuras, do not see the crown of the head of the buddhas, the blessed ones? However, if you want to see the height of the Tathāgata’s body, there is a pillar made of gośīrṣacandana underneath the fire pit for oblations to the god of fire in your house; take it out and measure it. The height of the Tathāgata’s body that is generated from a father and a mother is the same as that.”

source: །བྲམ་ཟེ་དབང་པོས་བསམས་པ།
en: The brahmin Indra thought, “This is a wonder.

source: དེ་ཡང་ངོ་མཚར་ཞིག་སྟེ་བདག་གིས་ལན་འགའ་ཡང་མ་ཐོས་ན་སོང་སྟེ་བལྟའོ་སྙམ་ནས་དེ་རིངས་པ་རིངས་པར་སོང་ནས་མེའི་སྦྱིན་སྲེག་བྱེད་པའི་ཐབ་ཀྱི་འོག་ཏུ་བརྐོ་བར་བརྩམས་པ་ལས་དེ་ཐམས་ཅད་དུ་དེ་བཞིན་དུ་གྱུར་ཏོ།
en: I have never heard of that. I will go and see.” He hurried home and dug under the fire pit for oblations to the god of fire. Everything was just as the Blessed One had explained.

source: །དེ་མངོན་པར་དད་པར་གྱུར་ནས་བསམ་པ། དགེ་སྦྱོང་གཽ་ཏ་མ་ནི་གདོན་མི་ཟ་བར་ཐམས་ཅད་མཁྱེན་པ་ཡིན་གྱིས་སོང་ལ་བསྙེན་བཀུར་བྱའོ་སྙམ་ནས་དེ་དད་པ་སྐྱེས་ཏེ་བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་སོང་ནས་ཕྱིན་པ་དང་། བཅོམ་ལྡན་འདས་དང་ལྷན་ཅིག་མངོན་དུ་ཡང་དག་པར་དགའ་བར་འགྱུར་བ་དང་། ཡང་དག་པར་མགུ་བར་འགྱུར་བའི་གཏམ་རྣམ་པ་སྣ་ཚོགས་བྱས་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ།
en: Filled with faith, he thought, “Since the śramaṇa Gautama is undoubtedly omniscient, I will go and serve him.” With faith, he went to the Blessed One. When he arrived, face to face with the Blessed One, he made plenty of pleasant and joyful conversation, and then sat down to one side.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་བསམ་པ་དང་། བག་ལ་ཉལ་དང་། ཁམས་དང་། རང་བཞིན་ཐུགས་སུ་ཆུད་ནས་ཞེས་བྱ་བ་ནས་ཐོག་མ་མེད་པའི་དུས་ནས་བསགས་པའི་འཇིག་ཚོགས་ལ་ལྟ་བའི་རིའི་རྩེ་མོ་ཉི་ཤུ་མཐོ་བ་ཡེ་ཤེས་ཀྱི་རྡོ་རྗེས་བཅོམ་ནས་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་ཏེ།
en: The Blessed One knew the brahmin’s thinking, proclivity, disposition, and nature . . . . With the vajra of knowledge the brahmin leveled the twenty high peaks of the mountain chain of the false view of individuality that had been accumulated since beginningless time, and actualized the fruit of stream-entry.

source: དེས་བདེན་པ་མཐོང་ནས་སྨྲས་པ། བཅོམ་ལྡན་འདས་བདག་ནི་འཕགས་སོ། །མངོན་པར་འཕགས་སོ།
en: After having seen the truths, he said, “O Blessed One, I have been exalted, truly exalted.

source: །དེ་ནས་བྲམ་ཟེ་དབང་པོ་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་བཅོམ་ལྡན་འདས་གང་ན་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །གལ་ཏེ་བཅོམ་ལྡན་འདས་ཀྱིས་གནང་ན་བདག་གིས་ཙན་དན་ས་མཆོག་གི་མཆོད་སྡོང་གི་དུས་མཆོད་བཤམས་ལགས་སོ།
en: Thereupon the brahmin Indra rose from his seat, draped his upper robe over one shoulder, made the gesture of supplication to the Blessed One, and said to the Blessed One, “If the Blessed One allows it, I will prepare a festival of the pillar made of gośīrṣacandana.”

source: བྲམ་ཟེ་གནང་གིས་སོང་ལ་ཤོམས་ཤིག །དེ་ནས་དེས་ས་ཕྱོགས་དབེན་པ་སྐབས་ཡོད་པ་ཞིག་ཏུ་རིམ་གྲོ་ཆེན་པོས་མཆོད་སྡོང་དེ་བསྒྲེངས་ནས་དུས་མཆོད་ཆེན་པོ་བཤམས་སོ།
en: “Go and prepare the festival.” Thereupon he set up the pillar in a certain solitary place with great reverence and prepared the great festival.

source: །བྲམ་ཟེ་དང་ཁྱིམ་བདག་གཞན་དག་གིས་ཀྱང་རྟེན་དགེ་བར་གྱུར་ཅིག་ཅེས་བྱ་བར་རིག་ནས།
en: Other brahmins and householders tied kuśa grass, thinking, “May this festival become a basis for happiness (kuśala).” Since the brahmin Indra had prepared the festival, it was named “Indra’s Festival.” VIII. Brahmin Village A.

source: རྩྭ་ཀུ་ཤ་བཏགས་ཏེ་བྲམ་ཟེ་དབང་པོས་མཆོད་སྡོང་གི་དུས་མཆོད་བཤམས་པས་ན་དབང་པོའི་དུས་མཆོད་ཅེས་བྱ་བར་གྲགས་སོ།
en: A Fire Caused by an Old Man from the Śākya Clan

source: །གང་གི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་མཉན་ཡོད་དུ་ཆོ་འཕྲུལ་ཆེན་པོ་བསྟན་པས་མུ་སྟེགས་ཅན་རྣམས་ནི་སྤ་བཀོང་། ལྷ་དང་མི་རྣམས་ནི་དགའ་བར་མཛད།
en: Once, when the Blessed One had displayed a great miracle in Śrāvastī and the non-Buddhist ascetics were frightened, the gods and humans were pleased, and good people were delighted.

source: སྐྱེ་བོ་དམ་པ་རྣམས་ནི་ཡི་རངས་པར་མཛད་པ་དེའི་ཚེ་མུ་སྟེགས་ཅན་རྣམས་བྲོས་ནས་མཐའ་འཁོབ་ཏུ་གནས་ཤིང་ཁ་ཅིག་ནི་བྲམ་ཟེའི་གྲོང་ཞེས་བྱ་བར་དོང་ནས་གནས་སོ།
en: The non-Buddhist ascetics then ran away and settled in the borderlands, some of them settling in a place named Brahmin Village.

source: །དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀོ་ས་ལའི་ལྗོངས་རྒྱུ་ཞིང་གཤེགས་པ་ན་བྲམ་ཟེའི་གྲོང་དུ་གཤེགས་སོ།
en: There the Blessed One, traveling through the country of Kosala, arrived in Brahmin Village.

source: །མུ་སྟེགས་ཅན་རྣམས་ཀྱིས་ནི་དགེ་སྦྱོང་གཽ་ཏ་མ་འོང་ངོ་ཞེས་ཐོས་སོ། །ཐོས་ནས་ཀྱང་རིངས་པ་རིངས་པར་བྲམ་ཟེ་དང་ཁྱིམ་བདག་རྣམས་ཀྱི་ཁྱིམ་དུ་དོང་སྟེ་ལྷགས་ནས་སྨྲས་པ།
en: When the non-Buddhist ascetics heard that the śramaṇa Gautama had come, they hurried to the houses of the brahmins and householders and said, “May the Dharma be attained!

source: ཆོས་ཐོས་པར་གྱུར་ཅིག །ཆོས་ཐོབ་པར་གྱུར་ཅིག །དེ་རྣམས་ཀྱིས་སྨྲས་པ།
en: May the Dharma be attained!”

source: འཕགས་པ་དག་དེ་ཅི་ཞིག་ཁོ་བོ་ཅག་གིས་ཁྱེད་ཀྱི་ཕུན་སུམ་ཚོགས་པ་ནི་མཐོང་གིས།
en: The brahmins and householders asked, “O noble ones, what’s wrong?”

source: ཇི་སྲིད་རྒུད་པ་མ་མཐོང་བ་དེའི་བར་དུ་འགྲོ་བར་བྱའོ།
en: “Since we have witnessed your prosperity, we will leave before we witness your decline.”

source: །དེ་རྣམས་ཀྱིས་སྨྲས་པ། འཕགས་པ་དག་བདག་ཅག་གི་རྒུད་པ་གང་ལགས།
en: “O noble ones, what will be our decline?” they asked.

source: ཤེས་ལྡན་དག་དགེ་སྦྱོང་གཽ་ཏ་མ་འཁོར་སྟོང་ཉིས་བརྒྱ་ལྔ་བཅུ་དང་སྤུ་གྲིའི་སེར་བ་འབེབས་ཤིང་འོང་སྟེ།
en: “Sirs, the śramaṇa Gautama is coming with twelve hundred and fifty attendants and causing hail like razors.

source: བུ་དང་བཅས་པ་དུམ་བུ་མེད་པར་བྱེད་པར་འགྱུར་རོ།
en: He will make those who have sons sonless.”

source: །དེ་རྣམས་ཀྱིས་སྨྲས་པ། འཕགས་པ་དག་གང་གི་ཚེ་ཁོ་ན་བཞུགས་ཤིང་གྲོགས་བགྱི་བ་ལ་ཐུག་པ་དེ་ཁོ་ནའི་ཚེ་བཞུད་པ་ནི་བཟང་པོ་མ་ལགས་ཏེ།
en: “O noble ones,” they replied, “it would not be good if you left at the very moment when you should stay and help us;

source: བདག་ཅག་རྣམ་པ་ཐམས་ཅད་དུ་མ་རུང་ངོ་།
en: this is unreasonable to us in every way!”

source: །དེ་རྣམས་ཀྱིས་སྨྲས་པ། དམ་ཞིག་བཅའ་སྟེ། གལ་ཏེ་དགེ་སྦྱོང་གཽ་ཏ་མ་གསོད་ན་ནི་འཁོད་པར་བྱའོ།
en: “We will stay if you promise to kill the śramaṇa Gautama,” they said.

source: །བཞུགས་ཤིག་གསད་པར་བགྱིའོ་ཞེས་དེ་རྣམས་ལག་ན་དབྱུག་པ་དང་གཞུ་ཐོགས། ཁུ་ཚུར་བཅངས།
en: “Please stay. We will kill him.” They departed armed, holding sticks and bows in their hands and clenching their fists.

source: གོ་བགོས་ཏེ་བྱུང་བ་དང་། ལམ་གྱི་དབུས་ན་ཤཱཀྱ་རྒན་པོ་ཞིག་འདུག་པས་མཐོང་ནས་སྨྲས་པ།
en: Along the way, there was an old man from the Śākya clan.

source: ཤེས་ལྡན་དག་གང་དུ་འདོང་།
en: He saw them and asked, “Sirs, where are you going?”

source: དེ་རྣམས་ཀྱིས་སྨྲས་པ། དགྲ་བསད་པའི་ཕྱིར་རོ།
en: They answered, “We are going to kill an enemy.”

source: །ཁྱེད་ཅག་གི་དགྲ་སུ་ཡིན།
en: “Who is your enemy?”

source: དགེ་སྦྱོང་གཽ་ཏ་མའོ།
en: “It is the śramaṇa Gautama.”

source: །ཤེས་ལྡན་དག་གལ་ཏེ་བཅོམ་ལྡན་འདས་དགྲ་ཡིན་ན་བྱམས་པ་གཞན་ཅི་འདྲ་བ་ཞིག་ཡིན། ཤེས་ལྡན་དག་སླར་ལོག་ཤིག །དེ་རྣམས་ལྡོག་ཏུ་མ་བཏུབ་པ་དང་། དེས་བསམས་པ།
en: “Sirs, if the Blessed One were your enemy, who else could be your friend? Sirs, go back.”

source: འདི་དག་ནི་ཆོས་བཤད་པའི་འོས་སུ་འགྱུར་བ་མ་ཡིན་གྱིས།
en: They would not go back, so he thought, “Since it is pointless to reason with these people, I should by all means drive them back.”

source: རྣམ་པ་ཐམས་ཅད་དུ་ཕ་རོལ་གནོན་པ་ཞིག་བྱའོ་སྙམ་ནས། དེས་རི་བྲགས་སུ་ཞུགས་ནས་མེ་བཏང་བ་དང་། རི་བྲགས་ཀུན་ཚིག་པས་ཅ་ཅོ་དང་ཀུ་ཅོའི་སྒྲ་ཆེན་པོ་བྱུང་བ་དེ་རྣམས་ཀྱིས་ཐོས་ནས་སྡངས་ཏེ་སྨྲས་པ།
en: He entered a hamlet and set fire to it, burning it down entirely. Great cries and a clamor rose up.

source: ཤེས་ལྡན་དག་བདག་ཅག་དང་དགེ་སྦྱོང་གཽ་ཏ་མ་ནི་ཐག་རིང་པོ་ཁོ་ན་ཡིན་གྱི།
en: The brahmins and householders became frightened when they heard all that and said, “Sirs, the śramaṇa Gautama is quite far away from us;

source: རི་བྲགས་འདིར་ནི་ཕུང་བ་ཆེན་པོ་གཞན་འདི་བྱུང་སྟེ་རི་བྲགས་བསྲེགས་ཀྱིས་མེ་བསད་ཀྱིས་སླར་ལྡོག་གོ་ཞེས་དེ་རྣམས་ཀྱིས་བསད་པར་བརྩམས་པ་དང་། བསད་པར་མ་ནུས་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱང་དེ་ཉིད་དུ་བྱོན་ནས་བཀའ་སྩལ་པ།
en: there is another great disaster right here in this hamlet. Since the hamlet is burning, let us turn back to extinguish the fire.” They tried to extinguish the fire, but in vain.

source: གནས་འཇོག་དག་འདི་ཅི་བྱེད།
en: The Blessed One arrived and asked, “Vāsiṣṭhas, what are you doing?”

source: བཅོམ་ལྡན་འདས་རི་བྲགས་རྣམས་ཞུགས་ཀྱིས་ཚིག་ན་དགུམ་པར་རྔོ་མ་ཐོག་ལགས་སོ།
en: “O Blessed One, the hamlets are being burned down by fire. We are not able to extinguish it.”

source: །ངས་བསད་དམ།
en: “Shall I extinguish it?”

source: བཅོམ་ལྡན་འདས་དགུམ་དུ་གསོལ།
en: “O Blessed One, please extinguish it.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་གསུང་ཕྱུང་མ་ཐག་ཁོ་ནར་འདི་ལྟར་ཡང་སངས་རྒྱས་རྣམས་ཀྱི་སངས་རྒྱས་ཀྱི་མཐུ་དང་། ལྷ་རྣམས་ཀྱི་ལྷའི་མཐུས་མེ་དེ་ཞི་བར་གྱུར་ཏོ།
en: As soon as the Blessed One uttered a word, the fire died by the awakened power of the buddhas and the divine power of the gods.

source: །དེ་རྣམས་མངོན་པར་དད་པར་གྱུར་ནས་གསོལ་པ། བཅོམ་ལྡན་འདས་ཅི་ཞིག་གི་སླད་དུ་གཤེགས་ལགས།
en: Filled with faith, the people asked, “O Blessed One, for what purpose have you come?”

source: ཁྱེད་ཅག་ཁོ་ན་རྗེས་སུ་གཟུང་བའི་ཕྱིར་རོ།
en: “For the purpose of accepting none other than you as followers.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་རྣམས་ཀྱི་བསམ་པ་དང་། བག་ལ་ཉལ་དང་། ཁམས་དང་། རང་བཞིན་མཁྱེན་ནས་དེ་དང་འདྲ་བའི་འཕགས་པའི་བདེན་པ་བཞི་སོ་སོར་རྟོགས་པར་འགྱུར་བའི་ཆོས་བཤད་པ་མཛད་དེ་ཞེས་བྱ་བ་ནས།
en: At once the Blessed One knew their thinking, proclivity, disposition, and nature, and preached the Dharma that was appropriate for them and that caused them to penetrate the four truths of the noble ones. . . . .

source: ཐོག་མ་མེད་པའི་དུས་ནས་བསགས་པའི་འཇིག་ཚོགས་ལ་ལྟ་བའི་རིའི་རྩེ་མོ་ཉི་ཤུ་མཐོ་བ་ཡེ་ཤེས་ཀྱི་རྡོ་རྗེས་བཅོམ་ནས་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་སོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: With the vajra of knowledge they leveled the twenty high peaks of the mountain chain of the false view of individuality that had been accumulated since beginningless time, and actualized the fruit of stream-entry. B. The Former Life of the Old Man

source: །དགེ་སློང་རྣམས་ཐེ་ཚོམ་སྐྱེས་ནས་ཐེ་ཚོམ་ཐམས་ཅད་གཅོད་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་ཞུས་པ། བཙུན་པ་ཤཱཀྱ་རྒན་པོ་འདིས་ཉེ་དུ་ལ་ཆགས་པས་བསོད་ནམས་མ་ལགས་པ་མང་དུ་བསགས་ཏེ་རི་བྲགས་བསྲེགས་པ་ལ་གཟིགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་ད་ལྟར་འབའ་ཞིག་ཏུ་མ་ཟད་དེ།
en: The monks, feeling doubtful, inquired of the Buddha, the Blessed One, the one who severs all doubts, “How is it, O Honored One, that this old man from the Śākya clan accumulated many nonmeritorious acts out of attachment to his relatives and burned down the hamlet?”

source: ཇི་ལྟར་འདིས་འདས་པའི་དུས་ན་ཡང་གཉེན་ལ་ཆགས་པས་བསོད་ནམས་མ་ཡིན་པ་མང་དུ་བསགས་ཏེ་རི་བྲགས་བསྲེགས་པ་དེ་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་བཤད་དོ།
en: “Listen, monks,” replied the Blessed One, “and inscribe it in your minds how, not only in the present but also in the past, he accumulated many nonmeritorious acts out of attachment to his relatives and burned down a hamlet. I will tell you about it.

source: །དགེ་སློང་དག་སྔོན་བྱུང་བ་རི་བྲགས་ཞིག་ན་སྤྲེའུ་ལྔ་བརྒྱའི་ཚོགས་གནས་པས་ལོ་ཐོག་སྐྱེས་ཤིང་སྐྱེས་པ་རྣམས་ཆུད་གསན་ཏོ།
en: “In a time long ago, monks, there lived a troop of five hundred monkeys in a certain hamlet. They used to spoil the crops when they ripened.

source: །རི་བྲགས་ན་གནས་པའི་སྐྱེ་བོའི་ཚོགས་འདུས་ནས་ཕན་ཚུན་དུ་གྲོས་བྱ་བར་བརྩམས་པ།
en: The people dwelling in the hamlet gathered and said to each other, ‘Sirs, the monkeys are damaging the crops.

source: ཤེས་ལྡན་དག་སྤྲེའུ་རྣམས་ཀྱིས་ལོ་ཐོག་ལ་གནོད་པ་བྱེད་ན་དེ་ལ་ཇི་ལྟར་བསྒྲུབ་པར་བྱ།
en: How should we deal with this?’

source: གཞན་དག་གིས་སྨྲས་པ་སྤྲེའུ་རྣམས་གསད་མོད།
en: “Some people said, ‘The monkeys should be killed.’

source: དེ་རྣམས་ཇི་ལྟར་གསད་པར་བྱ།
en: “ ‘How should we kill them?’

source: རི་བྲགས་ཀྱི་ཉེན་ཀོར་གྱི་ཤིང་ཐམས་ཅད་བཅད་དེ་ཤིང་ཏིན་ཏུ་ཀ་གཅིག་པུ་ཞིག་བཞག་ལ་ཉེན་ཀོར་རྣམས་ཚེར་མས་བསྐོར་ཏང་དེ་ལ་བཟའ་བའི་ཕྱིར་སྤྲེའུ་རྣམས་འཛེག་པར་འགྱུར་ཏེ།
en: “ ‘Let’s cut down all the trees around the hamlet, leaving only one persimmon tree, and surround it with thorns.

source: དེ་ལྟར་གྱུར་ཏང་དེར་དེ་རྣམས་གསད་པར་བྱའོ།
en: When the monkeys have climbed it to eat the fruit, there we should kill them.’

source: །དེ་ནས་དེ་རྣམས་ཀྱིས་བྲགས་ཀྱི་ཉེན་ཀོར་གྱི་ཤིང་ཐམས་ཅད་བཅད་དེ་ཤིང་ཏིན་ཏུ་ཀ་གཅིག་པུ་བཞག་ནས་ཉེན་ཀོར་རྣམས་ཚེར་མའི་ར་བས་བསྐོར་ཏེ་སྲུང་མ་པའི་མི་བཞག་ནས་བསྒོ་བ།
en: “Thereupon they cut down all the trees around the hamlet, leaving only one persimmon tree, and surrounded it with thorns.
